; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=327, out_folder=./training, instance_id=69, seed=2093, goal_proportion=0.03

(define (problem blocksworld-69)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 - object)
 (:init 
    (arm-empty)
    (clear b93)
    (on b93 b254)
    (on-table b254)
    (clear b179)
    (on-table b179)
    (clear b298)
    (on-table b298)
    (clear b78)
    (on-table b78)
    (clear b30)
    (on b30 b49)
    (on b49 b51)
    (on b51 b320)
    (on b320 b258)
    (on b258 b290)
    (on b290 b122)
    (on-table b122)
    (clear b91)
    (on b91 b80)
    (on b80 b96)
    (on b96 b259)
    (on b259 b260)
    (on b260 b75)
    (on b75 b12)
    (on b12 b313)
    (on b313 b66)
    (on b66 b177)
    (on b177 b55)
    (on-table b55)
    (clear b300)
    (on-table b300)
    (clear b1)
    (on b1 b272)
    (on b272 b223)
    (on-table b223)
    (clear b43)
    (on-table b43)
    (clear b145)
    (on b145 b277)
    (on-table b277)
    (clear b15)
    (on b15 b325)
    (on b325 b9)
    (on b9 b25)
    (on b25 b48)
    (on b48 b273)
    (on-table b273)
    (clear b57)
    (on b57 b166)
    (on-table b166)
    (clear b170)
    (on b170 b251)
    (on-table b251)
    (clear b164)
    (on b164 b135)
    (on b135 b156)
    (on b156 b227)
    (on b227 b22)
    (on b22 b163)
    (on b163 b176)
    (on b176 b270)
    (on b270 b104)
    (on b104 b217)
    (on b217 b128)
    (on b128 b224)
    (on b224 b109)
    (on b109 b53)
    (on b53 b44)
    (on b44 b144)
    (on b144 b289)
    (on b289 b308)
    (on b308 b301)
    (on b301 b125)
    (on b125 b18)
    (on b18 b113)
    (on b113 b327)
    (on b327 b318)
    (on b318 b269)
    (on-table b269)
    (clear b231)
    (on-table b231)
    (clear b118)
    (on-table b118)
    (clear b7)
    (on-table b7)
    (clear b185)
    (on b185 b311)
    (on b311 b46)
    (on-table b46)
    (clear b264)
    (on b264 b19)
    (on b19 b190)
    (on-table b190)
    (clear b3)
    (on b3 b191)
    (on-table b191)
    (clear b271)
    (on b271 b274)
    (on-table b274)
    (clear b70)
    (on b70 b31)
    (on-table b31)
    (clear b243)
    (on b243 b47)
    (on b47 b250)
    (on-table b250)
    (clear b192)
    (on b192 b150)
    (on-table b150)
    (clear b317)
    (on b317 b193)
    (on b193 b246)
    (on b246 b157)
    (on b157 b281)
    (on b281 b102)
    (on b102 b52)
    (on b52 b189)
    (on b189 b64)
    (on b64 b235)
    (on b235 b171)
    (on b171 b61)
    (on-table b61)
    (clear b83)
    (on b83 b307)
    (on b307 b302)
    (on-table b302)
    (clear b50)
    (on b50 b205)
    (on b205 b119)
    (on b119 b37)
    (on b37 b238)
    (on b238 b228)
    (on b228 b149)
    (on b149 b132)
    (on b132 b146)
    (on b146 b212)
    (on b212 b103)
    (on b103 b276)
    (on-table b276)
    (clear b34)
    (on b34 b239)
    (on-table b239)
    (clear b194)
    (on b194 b26)
    (on b26 b141)
    (on b141 b286)
    (on b286 b245)
    (on b245 b95)
    (on b95 b202)
    (on b202 b94)
    (on-table b94)
    (clear b33)
    (on b33 b219)
    (on b219 b240)
    (on-table b240)
    (clear b158)
    (on b158 b63)
    (on b63 b253)
    (on b253 b124)
    (on b124 b82)
    (on b82 b84)
    (on b84 b309)
    (on b309 b299)
    (on-table b299)
    (clear b319)
    (on-table b319)
    (clear b126)
    (on b126 b153)
    (on b153 b267)
    (on-table b267)
    (clear b38)
    (on b38 b155)
    (on-table b155)
    (clear b137)
    (on b137 b100)
    (on-table b100)
    (clear b222)
    (on-table b222)
    (clear b73)
    (on b73 b62)
    (on-table b62)
    (clear b207)
    (on b207 b255)
    (on-table b255)
    (clear b121)
    (on-table b121)
    (clear b262)
    (on b262 b247)
    (on b247 b136)
    (on b136 b168)
    (on-table b168)
    (clear b89)
    (on b89 b237)
    (on-table b237)
    (clear b315)
    (on b315 b242)
    (on b242 b173)
    (on b173 b130)
    (on-table b130)
    (clear b140)
    (on b140 b20)
    (on b20 b17)
    (on-table b17)
    (clear b36)
    (on b36 b138)
    (on b138 b200)
    (on-table b200)
    (clear b111)
    (on-table b111)
    (clear b54)
    (on-table b54)
    (clear b314)
    (on-table b314)
    (clear b110)
    (on b110 b16)
    (on-table b16)
    (clear b225)
    (on b225 b221)
    (on b221 b316)
    (on b316 b285)
    (on b285 b236)
    (on b236 b174)
    (on-table b174)
    (clear b142)
    (on b142 b86)
    (on-table b86)
    (clear b14)
    (on b14 b76)
    (on b76 b134)
    (on b134 b2)
    (on b2 b107)
    (on b107 b59)
    (on b59 b293)
    (on b293 b88)
    (on b88 b99)
    (on b99 b105)
    (on b105 b295)
    (on b295 b11)
    (on-table b11)
    (clear b326)
    (on b326 b5)
    (on b5 b208)
    (on-table b208)
    (clear b32)
    (on b32 b161)
    (on b161 b182)
    (on b182 b186)
    (on b186 b123)
    (on b123 b178)
    (on b178 b198)
    (on b198 b230)
    (on b230 b165)
    (on b165 b10)
    (on b10 b203)
    (on-table b203)
    (clear b306)
    (on b306 b133)
    (on b133 b152)
    (on-table b152)
    (clear b323)
    (on-table b323)
    (clear b69)
    (on b69 b27)
    (on b27 b278)
    (on-table b278)
    (clear b120)
    (on b120 b23)
    (on b23 b241)
    (on b241 b263)
    (on b263 b129)
    (on-table b129)
    (clear b304)
    (on b304 b197)
    (on b197 b187)
    (on-table b187)
    (clear b211)
    (on b211 b183)
    (on-table b183)
    (clear b42)
    (on b42 b201)
    (on b201 b232)
    (on b232 b172)
    (on-table b172)
    (clear b188)
    (on b188 b204)
    (on-table b204)
    (clear b324)
    (on b324 b252)
    (on b252 b218)
    (on b218 b8)
    (on-table b8)
    (clear b85)
    (on b85 b199)
    (on b199 b29)
    (on-table b29)
    (clear b39)
    (on b39 b291)
    (on b291 b56)
    (on b56 b292)
    (on-table b292)
    (clear b87)
    (on b87 b167)
    (on b167 b98)
    (on-table b98)
    (clear b195)
    (on b195 b266)
    (on b266 b215)
    (on b215 b196)
    (on-table b196)
    (clear b77)
    (on b77 b58)
    (on b58 b310)
    (on b310 b216)
    (on b216 b249)
    (on b249 b92)
    (on b92 b181)
    (on b181 b248)
    (on b248 b67)
    (on-table b67)
    (clear b45)
    (on b45 b108)
    (on b108 b226)
    (on-table b226)
    (clear b40)
    (on b40 b256)
    (on b256 b21)
    (on b21 b41)
    (on b41 b282)
    (on b282 b288)
    (on b288 b154)
    (on b154 b117)
    (on b117 b303)
    (on b303 b24)
    (on b24 b162)
    (on-table b162)
    (clear b175)
    (on b175 b213)
    (on b213 b209)
    (on b209 b143)
    (on b143 b65)
    (on b65 b112)
    (on b112 b114)
    (on b114 b72)
    (on b72 b151)
    (on b151 b159)
    (on b159 b233)
    (on b233 b35)
    (on b35 b234)
    (on b234 b60)
    (on-table b60)
    (clear b287)
    (on b287 b106)
    (on b106 b90)
    (on-table b90)
    (clear b147)
    (on b147 b322)
    (on b322 b268)
    (on-table b268)
    (clear b116)
    (on b116 b257)
    (on b257 b214)
    (on b214 b294)
    (on b294 b139)
    (on-table b139)
    (clear b115)
    (on-table b115)
    (clear b265)
    (on b265 b180)
    (on b180 b229)
    (on b229 b312)
    (on b312 b297)
    (on b297 b160)
    (on b160 b283)
    (on b283 b6)
    (on b6 b131)
    (on-table b131)
    (clear b74)
    (on-table b74)
    (clear b28)
    (on-table b28)
    (clear b280)
    (on-table b280)
    (clear b127)
    (on b127 b261)
    (on b261 b68)
    (on b68 b148)
    (on b148 b4)
    (on b4 b305)
    (on b305 b101)
    (on b101 b296)
    (on b296 b244)
    (on b244 b279)
    (on b279 b275)
    (on b275 b71)
    (on b71 b210)
    (on b210 b81)
    (on b81 b169)
    (on b169 b97)
    (on b97 b206)
    (on b206 b321)
    (on-table b321)
    (clear b79)
    (on b79 b13)
    (on b13 b184)
    (on b184 b284)
    (on b284 b220)
    (on-table b220))
 (:goal  (and 
    (clear b4)
    (on b4 b6)
    (on b6 b1)
    (on b1 b5)
    (on-table b5)
    (clear b3)
    (on b3 b2)
    (on b2 b9)
    (on b9 b7)
    (on b7 b8)
    (on-table b8))))

; plan
1. (unstack b127 b261)
   deleted: (on b127 b261) (clear b127) (arm-empty)
   added: (holding b127) (clear b261)
   goals met: 2 of 11
2. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 2 of 11
3. (unstack b14 b76)
   deleted: (on b14 b76) (clear b14) (arm-empty)
   added: (holding b14) (clear b76)
   goals met: 2 of 11
4. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 11
5. (unstack b15 b325)
   deleted: (on b15 b325) (clear b15) (arm-empty)
   added: (holding b15) (clear b325)
   goals met: 2 of 11
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 11
7. (unstack b261 b68)
   deleted: (on b261 b68) (clear b261) (arm-empty)
   added: (holding b261) (clear b68)
   goals met: 2 of 11
8. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 2 of 11
9. (unstack b265 b180)
   deleted: (on b265 b180) (clear b265) (arm-empty)
   added: (holding b265) (clear b180)
   goals met: 2 of 11
10. (putdown b265)
   deleted: (holding b265)
   added: (clear b265) (arm-empty) (on-table b265)
   goals met: 2 of 11
11. (unstack b180 b229)
   deleted: (on b180 b229) (clear b180) (arm-empty)
   added: (holding b180) (clear b229)
   goals met: 2 of 11
12. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 2 of 11
13. (unstack b229 b312)
   deleted: (on b229 b312) (clear b229) (arm-empty)
   added: (holding b229) (clear b312)
   goals met: 2 of 11
14. (putdown b229)
   deleted: (holding b229)
   added: (clear b229) (arm-empty) (on-table b229)
   goals met: 2 of 11
15. (unstack b312 b297)
   deleted: (on b312 b297) (clear b312) (arm-empty)
   added: (holding b312) (clear b297)
   goals met: 2 of 11
16. (putdown b312)
   deleted: (holding b312)
   added: (clear b312) (arm-empty) (on-table b312)
   goals met: 2 of 11
17. (unstack b297 b160)
   deleted: (on b297 b160) (clear b297) (arm-empty)
   added: (holding b297) (clear b160)
   goals met: 2 of 11
18. (putdown b297)
   deleted: (holding b297)
   added: (clear b297) (arm-empty) (on-table b297)
   goals met: 2 of 11
19. (unstack b160 b283)
   deleted: (on b160 b283) (clear b160) (arm-empty)
   added: (holding b160) (clear b283)
   goals met: 2 of 11
20. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 2 of 11
21. (unstack b283 b6)
   deleted: (on b283 b6) (clear b283) (arm-empty)
   added: (holding b283) (clear b6)
   goals met: 2 of 11
22. (putdown b283)
   deleted: (holding b283)
   added: (clear b283) (arm-empty) (on-table b283)
   goals met: 2 of 11
23. (unstack b324 b252)
   deleted: (on b324 b252) (clear b324) (arm-empty)
   added: (holding b324) (clear b252)
   goals met: 2 of 11
24. (putdown b324)
   deleted: (holding b324)
   added: (clear b324) (arm-empty) (on-table b324)
   goals met: 2 of 11
25. (unstack b252 b218)
   deleted: (on b252 b218) (clear b252) (arm-empty)
   added: (holding b252) (clear b218)
   goals met: 2 of 11
26. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 2 of 11
27. (unstack b218 b8)
   deleted: (on b218 b8) (clear b218) (arm-empty)
   added: (holding b218) (clear b8)
   goals met: 2 of 11
28. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 2 of 11
29. (unstack b325 b9)
   deleted: (on b325 b9) (clear b325) (arm-empty)
   added: (holding b325) (clear b9)
   goals met: 2 of 11
30. (putdown b325)
   deleted: (holding b325)
   added: (clear b325) (arm-empty) (on-table b325)
   goals met: 2 of 11
31. (unstack b326 b5)
   deleted: (on b326 b5) (clear b326) (arm-empty)
   added: (holding b326) (clear b5)
   goals met: 2 of 11
32. (putdown b326)
   deleted: (holding b326)
   added: (clear b326) (arm-empty) (on-table b326)
   goals met: 2 of 11
33. (unstack b5 b208)
   deleted: (on b5 b208) (clear b5) (arm-empty)
   added: (holding b5) (clear b208)
   goals met: 2 of 11
34. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 11
35. (unstack b68 b148)
   deleted: (on b68 b148) (clear b68) (arm-empty)
   added: (holding b68) (clear b148)
   goals met: 3 of 11
36. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 3 of 11
37. (unstack b148 b4)
   deleted: (on b148 b4) (clear b148) (arm-empty)
   added: (holding b148) (clear b4)
   goals met: 4 of 11
38. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 4 of 11
39. (unstack b76 b134)
   deleted: (on b76 b134) (clear b76) (arm-empty)
   added: (holding b76) (clear b134)
   goals met: 4 of 11
40. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 4 of 11
41. (unstack b134 b2)
   deleted: (on b134 b2) (clear b134) (arm-empty)
   added: (holding b134) (clear b2)
   goals met: 4 of 11
42. (putdown b134)
   deleted: (holding b134)
   added: (clear b134) (arm-empty) (on-table b134)
   goals met: 4 of 11
43. (unstack b1 b272)
   deleted: (on b1 b272) (clear b1) (arm-empty)
   added: (holding b1) (clear b272)
   goals met: 4 of 11
44. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 5 of 11
45. (unstack b2 b107)
   deleted: (on b2 b107) (clear b2) (arm-empty)
   added: (holding b2) (clear b107)
   goals met: 5 of 11
46. (stack b2 b9)
   deleted: (clear b9) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b9)
   goals met: 6 of 11
47. (unstack b6 b131)
   deleted: (on b6 b131) (clear b6) (arm-empty)
   added: (holding b6) (clear b131)
   goals met: 6 of 11
48. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 11
49. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 11
50. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 8 of 11
51. (unstack b3 b191)
   deleted: (on b3 b191) (clear b3) (arm-empty)
   added: (holding b3) (clear b191)
   goals met: 7 of 11
52. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 9 of 11
53. (unstack b4 b305)
   deleted: (on b4 b305) (clear b4) (arm-empty)
   added: (holding b4) (clear b305)
   goals met: 8 of 11
54. (stack b4 b6)
   deleted: (clear b6) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b6)
   goals met: 10 of 11
55. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 8 of 11
56. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 9 of 11
57. (unstack b2 b9)
   deleted: (on b2 b9) (clear b2) (arm-empty)
   added: (holding b2) (clear b9)
   goals met: 8 of 11
58. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 11
59. (unstack b9 b25)
   deleted: (on b9 b25) (clear b9) (arm-empty)
   added: (holding b9) (clear b25)
   goals met: 8 of 11
60. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 9 of 11
61. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 11
62. (stack b2 b9)
   deleted: (clear b9) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b9)
   goals met: 10 of 11
63. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 9 of 11
64. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 11 of 11
